In [1]:
import pandas as pd
import numpy as np

In [6]:
dict1={
    "name":['Ayu', 'Anu', 'Aditi'],
    "marks":[98, 97, 96],
    "city":['Mumbai', 'delhi', 'pune']
}

In [9]:
df=pd.DataFrame(dict1)

In [10]:
df

    name  marks    city
0    Ayu     98  Mumbai
1    Anu     97   delhi
2  Aditi     96    pune

In [15]:
df.head(2)

  name  marks    city
0  Ayu     98  Mumbai
1  Anu     97   delhi

In [16]:
df.tail(2)

    name  marks   city
1    Anu     97  delhi
2  Aditi     96   pune

In [17]:
df.describe()

       marks
count    3.0
mean    97.0
std      1.0
min     96.0
25%     96.5
50%     97.0
75%     97.5
max     98.0

In [11]:
df.to_csv('sisters.csv')

In [13]:
df.to_csv('sisters.csv_0', index=False)

In [21]:
train = pd.read_csv('train.csv')

In [22]:
train

   train no  time    city
0     15318     7  Mumbai
1     15218     8   delhi
2     15217    11    pune

train ['time'][0] = 9

In [27]:
train

   train no  time    city
a     15318     7  Mumbai
b     15218     8   delhi
c     15217    11    pune

In [25]:
train.index= ['a', 'b', 'c']

In [26]:
train

   train no  time    city
a     15318     7  Mumbai
b     15218     8   delhi
c     15217    11    pune